"use strict";

function ndigit(number, count) {
	var divide = Math.pow(10,count - 1); // Определяем порядок

	// Если число отрицательное, делаем инверсию
	if (number < 0) {
		number = ~number;
	}
	if ((number < divide) || (count < 1)) {
		// Если указанный порядок count недоступен
		return -1;
	} else {
		// Вычисляем необходимое значение
		return (number / divide | 0) % 10;
	}
}

// Проверяем работу функции
alert(
	"По заданию:\n" +
	"\"125692, 3\" - \"" + ndigit(125692, 3) + "\"\n" +
	"\"10, 1\" - \"" + ndigit(10, 1) + "\"\n" +
	"\"-793, 2\" - \"" + ndigit(-793, 2) + "\"\n" +
	"\"9, 2\" - \"" + ndigit(9, 2) + "\"\n" +
	"\"329, 0\" - \"" + ndigit(329, 0) + "\"\n" +
	"От себя:\n" +
	"\"0, 0\" - \"" + ndigit(0, 0) + "\"\n" +
	"\"532, 3\" - \"" + ndigit(532, 3) + "\"\n" +
	"\"15, -1\" - \"" + ndigit(15, -1) + "\"\n"
);
